In [13]:
import pandas as pd

In [17]:
# 1.リスト型の値を持った配列を使ったDataFrameの作成

In [18]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                columns=['col01','col02','col03'],
                index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [34]:
print(f'①：{df[0:1]}\n')
print(f'②：{df[0:2]}\n')
print(f'③：{df[0:3]}\n')
print(f'④：{df[1:1]}\n')
print(f'⑤：{df[1:2]}\n')
print(f'⑥：{df[1:3]}\n')
print(f'⑦：{df[2:1]}\n')
print(f'⑧：{df[2:2]}\n')
print(f'⑨：{df[2:3]}\n')
print(f'⑩：{df[3:1]}\n')

①：       col01  col02  col03
idx01      1      2      3

②：       col01  col02  col03
idx01      1      2      3
idx02      4      5      6

③：       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

④：Empty DataFrame
Columns: [col01, col02, col03]
Index: []

⑤：       col01  col02  col03
idx02      4      5      6

⑥：       col01  col02  col03
idx02      4      5      6
idx03      7      8      9

⑦：Empty DataFrame
Columns: [col01, col02, col03]
Index: []

⑧：Empty DataFrame
Columns: [col01, col02, col03]
Index: []

⑨：       col01  col02  col03
idx03      7      8      9

⑩：Empty DataFrame
Columns: [col01, col02, col03]
Index: []

In [9]:
# 2.NumPyの配列を使ったDataFrameの作成

In [10]:
import numpy as np

In [11]:
df=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                columns=['col01','col02','col03'],
                index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [12]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [13]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [14]:
# 3.NumPyの配列を使ったDataFrameの作成

In [15]:
df=pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})
df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [16]:
df=pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]}
               ,index=['idx01','idx02','idx03'])

df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [17]:
#カラム・インデックスの操作

In [18]:
df=pd.DataFrame([[1,2,3],
                 [4,5,6],
                 [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df.columns=['col01','col02','col03']
df.index=['idx01','idx02','idx03']

In [20]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [21]:
df.columns=['col04','col05','col06']
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [22]:
df=df.rename(columns={'col04':'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [23]:
df=df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [24]:
df=df.rename(index={'idx01':'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [25]:
 df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [26]:
type(df['x'])

pandas.core.series.Series

In [27]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [28]:
df.loc[:,'x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [29]:
df.iloc[:,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [30]:
df=df.rename(index={'w':'idx01'})
df=df.rename(columns={'x':'col01','y':'col02','z':'col03',})
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [31]:
df.loc['idx03','col02']

8

In [32]:
df.loc['idx03','col02']=100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [33]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [34]:
# スライス操作
# 以下は第一引数で行を全て選択、列では最初の行(0行目)はスキップ・3は範囲外なので無視される
df.iloc[:,1:3]

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [35]:
# 行番号の取得
df.index.get_loc('idx03')

2

In [36]:
# 列番号を取得
df.columns.get_loc('col02')

1

In [37]:
# 行番号・列番号の指定による特定セル内容の変更
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000

In [38]:
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [39]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [40]:
# 列数と行数の一括取得
df.shape

(3, 3)

In [41]:
# 行と列の入れ替え
df=df.T

In [42]:
df

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido